Revit 2026 API

# AngularDimensionSetAngularRadius Method

---

Set radius of an Angular Dimension arc. The new radius of the arc.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAngularRadius(
	double radius
)
```
```vb
Public Sub SetAngularRadius (
	radius As Double
)
```
```cpp
public:
void SetAngularRadius(
	double radius
)
```
```fsharp
member SetAngularRadius :
        radius : float -> unit
```

#### Parameters

radius Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The given value for radius must be non-negative. |

#### Reference

AngularDimension Class

Autodesk.Revit.DB Namespace